betaflight/betaflight/lib/main/tinyUSB/hw/bsp/kinetis_k/boards/frdm_k64f/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTC6 (number 78), U8[11]/SW2
  @{ */
/* Routed pin properties */
#define BOARD_SW2_PERIPHERAL GPIOC                  /*!<@brief Peripheral name */
#define BOARD_SW2_SIGNAL GPIO                       /*!<@brief Signal name */
#define BOARD_SW2_CHANNEL 6                         /*!<@brief Signal channel */
#define BOARD_SW2_PIN_NAME PTC6                     /*!<@brief Routed pin name */
#define BOARD_SW2_LABEL "U8[11]/SW2"                /*!<@brief Label */
#define BOARD_SW2_NAME "SW2"                        /*!<@brief Identifier */
#define BOARD_SW2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_SW2_GPIO GPIOC                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW2_GPIO_PIN 6U                       /*!<@brief GPIO pin number */
#define BOARD_SW2_GPIO_PIN_MASK (1U << 6U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW2_PORT PORTC                        /*!<@brief PORT peripheral base pointer */
#define BOARD_SW2_PIN 6U                            /*!<@brief PORT pin number */
#define BOARD_SW2_PIN_MASK (1U << 6U)               /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTA4 (number 38), SW3
  @{ */
/* Routed pin properties */
#define BOARD_SW3_PERIPHERAL GPIOA                  /*!<@brief Peripheral name */
#define BOARD_SW3_SIGNAL GPIO                       /*!<@brief Signal name */
#define BOARD_SW3_CHANNEL 4                         /*!<@brief Signal channel */
#define BOARD_SW3_PIN_NAME PTA4                     /*!<@brief Routed pin name */
#define BOARD_SW3_LABEL "SW3"                       /*!<@brief Label */
#define BOARD_SW3_NAME "SW3"                        /*!<@brief Identifier */
#define BOARD_SW3_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_SW3_GPIO GPIOA                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW3_GPIO_PIN 4U                       /*!<@brief GPIO pin number */
#define BOARD_SW3_GPIO_PIN_MASK (1U << 4U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW3_PORT PORTA                        /*!<@brief PORT peripheral base pointer */
#define BOARD_SW3_PIN 4U                            /*!<@brief PORT pin number */
#define BOARD_SW3_PIN_MASK (1U << 4U)               /*!<@brief PORT pin mask */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtons(void);

/*! @name PORTB21 (number 67), D12[3]/LEDRGB_BLUE
  @{ */
/* Routed pin properties */
#define BOARD_LED_BLUE_PERIPHERAL GPIOB                   /*!<@brief Peripheral name */
#define BOARD_LED_BLUE_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_LED_BLUE_CHANNEL 21                         /*!<@brief Signal channel */
#define BOARD_LED_BLUE_PIN_NAME PTB21                     /*!<@brief Routed pin name */
#define BOARD_LED_BLUE_LABEL "D12[3]/LEDRGB_BLUE"         /*!<@brief Label */
#define BOARD_LED_BLUE_NAME "LED_BLUE"                    /*!<@brief Identifier */
#define BOARD_LED_BLUE_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_BLUE_GPIO GPIOB                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_BLUE_GPIO_PIN 21U                       /*!<@brief GPIO pin number */
#define BOARD_LED_BLUE_GPIO_PIN_MASK (1U << 21U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED_BLUE_PORT PORTB                         /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_BLUE_PIN 21U                            /*!<@brief PORT pin number */
#define BOARD_LED_BLUE_PIN_MASK (1U << 21U)               /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTB22 (number 68), D12[1]/LEDRGB_RED
  @{ */
/* Routed pin properties */
#define BOARD_LED_RED_PERIPHERAL GPIOB                   /*!<@brief Peripheral name */
#define BOARD_LED_RED_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_LED_RED_CHANNEL 22                         /*!<@brief Signal channel */
#define BOARD_LED_RED_PIN_NAME PTB22                     /*!<@brief Routed pin name */
#define BOARD_LED_RED_LABEL "D12[1]/LEDRGB_RED"          /*!<@brief Label */
#define BOARD_LED_RED_NAME "LED_RED"                     /*!<@brief Identifier */
#define BOARD_LED_RED_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

