betaflight/betaflight/lib/main/tinyUSB/hw/bsp/kinetis_k/boards/frdm_k64f/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_LED_RED_GPIO GPIOB                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_RED_GPIO_PIN 22U                       /*!<@brief GPIO pin number */
#define BOARD_LED_RED_GPIO_PIN_MASK (1U << 22U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED_RED_PORT PORTB                         /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_RED_PIN 22U                            /*!<@brief PORT pin number */
#define BOARD_LED_RED_PIN_MASK (1U << 22U)               /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTE26 (number 33), J2[1]/D12[4]/LEDRGB_GREEN
  @{ */
/* Routed pin properties */
#define BOARD_LED_GREEN_PERIPHERAL GPIOE                   /*!<@brief Peripheral name */
#define BOARD_LED_GREEN_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_LED_GREEN_CHANNEL 26                         /*!<@brief Signal channel */
#define BOARD_LED_GREEN_PIN_NAME PTE26                     /*!<@brief Routed pin name */
#define BOARD_LED_GREEN_LABEL "J2[1]/D12[4]/LEDRGB_GREEN"  /*!<@brief Label */
#define BOARD_LED_GREEN_NAME "LED_GREEN"                   /*!<@brief Identifier */
#define BOARD_LED_GREEN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_GREEN_GPIO GPIOE                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_GREEN_GPIO_PIN 26U                       /*!<@brief GPIO pin number */
#define BOARD_LED_GREEN_GPIO_PIN_MASK (1U << 26U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED_GREEN_PORT PORTE                         /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_GREEN_PIN 26U                            /*!<@brief PORT pin number */
#define BOARD_LED_GREEN_PIN_MASK (1U << 26U)               /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDs(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB17 (number 63), U10[1]/UART0_TX
  @{ */
/* Routed pin properties */
#define BOARD_DEBUG_UART_TX_PERIPHERAL UART0                   /*!<@brief Peripheral name */
#define BOARD_DEBUG_UART_TX_SIGNAL TX                          /*!<@brief Signal name */
#define BOARD_DEBUG_UART_TX_PIN_NAME UART0_TX                  /*!<@brief Routed pin name */
#define BOARD_DEBUG_UART_TX_LABEL "U10[1]/UART0_TX"            /*!<@brief Label */
#define BOARD_DEBUG_UART_TX_NAME "DEBUG_UART_TX"               /*!<@brief Identifier */
#define BOARD_DEBUG_UART_TX_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_TX_PORT PORTB                         /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_TX_PIN 17U                            /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK (1U << 17U)               /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTB16 (number 62), U7[4]/UART0_RX
  @{ */
/* Routed pin properties */
#define BOARD_DEBUG_UART_RX_PERIPHERAL UART0          /*!<@brief Peripheral name */
#define BOARD_DEBUG_UART_RX_SIGNAL RX                 /*!<@brief Signal name */
#define BOARD_DEBUG_UART_RX_PIN_NAME UART0_RX         /*!<@brief Routed pin name */
#define BOARD_DEBUG_UART_RX_LABEL "U7[4]/UART0_RX"    /*!<@brief Label */
#define BOARD_DEBUG_UART_RX_NAME "DEBUG_UART_RX"      /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_RX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_RX_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

/*! @name PORTA18 (number 50), U13[16]/RMII_RXCLK
  @{ */
/* Routed pin properties */
#define BOARD_EXTAL0_PERIPHERAL OSC             /*!<@brief Peripheral name */
#define BOARD_EXTAL0_SIGNAL EXTAL0              /*!<@brief Signal name */
#define BOARD_EXTAL0_PIN_NAME EXTAL0            /*!<@brief Routed pin name */
#define BOARD_EXTAL0_LABEL "U13[16]/RMII_RXCLK" /*!<@brief Label */
#define BOARD_EXTAL0_NAME "EXTAL0"              /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_EXTAL0_PORT PORTA                 /*!<@brief PORT peripheral base pointer */
#define BOARD_EXTAL0_PIN 18U                    /*!<@brief PORT pin number */
#define BOARD_EXTAL0_PIN_MASK (1U << 18U)       /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name EXTAL32 (number 29), Y3[2]/EXTAL32_RTC
  @{ */
/* Routed pin properties */
#define BOARD_ETAL32K_PERIPHERAL RTC            /*!<@brief Peripheral name */
#define BOARD_ETAL32K_SIGNAL EXTAL32            /*!<@brief Signal name */
#define BOARD_ETAL32K_PIN_NAME EXTAL32          /*!<@brief Routed pin name */
#define BOARD_ETAL32K_LABEL "Y3[2]/EXTAL32_RTC" /*!<@brief Label */
#define BOARD_ETAL32K_NAME "ETAL32K"            /*!<@brief Identifier */
                                                /* @} */

/*! @name XTAL32 (number 28), Y3[1]/XTAL32_RTC
  @{ */
/* Routed pin properties */
#define BOARD_XTAL32K_PERIPHERAL RTC           /*!<@brief Peripheral name */
#define BOARD_XTAL32K_SIGNAL XTAL32            /*!<@brief Signal name */
#define BOARD_XTAL32K_PIN_NAME XTAL32          /*!<@brief Routed pin name */
#define BOARD_XTAL32K_LABEL "Y3[1]/XTAL32_RTC" /*!<@brief Label */
#define BOARD_XTAL32K_NAME "XTAL32K"           /*!<@brief Identifier */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSC(void);

