betaflight/betaflight/lib/main/tinyUSB/hw/bsp/kinetis_k/boards/frdm_k64f/board/pin_mux.h
/*! @name PORTE5 (number 6), J15[P1]/SDHC0_D2
  @{ */
/* Routed pin properties */
#define BOARD_SDHC0_D2_PERIPHERAL SDHC          /*!<@brief Peripheral name */
#define BOARD_SDHC0_D2_SIGNAL DATA              /*!<@brief Signal name */
#define BOARD_SDHC0_D2_CHANNEL 2                /*!<@brief Signal channel */
#define BOARD_SDHC0_D2_PIN_NAME SDHC0_D2        /*!<@brief Routed pin name */
#define BOARD_SDHC0_D2_LABEL "J15[P1]/SDHC0_D2" /*!<@brief Label */
#define BOARD_SDHC0_D2_NAME "SDHC0_D2"          /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_SDHC0_D2_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_SDHC0_D2_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_SDHC0_D2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTE6 (number 7), J15[G1]/SD_CARD_DETECT
  @{ */
/* Routed pin properties */
#define BOARD_SDHC_CD_PERIPHERAL GPIOE                  /*!<@brief Peripheral name */
#define BOARD_SDHC_CD_SIGNAL GPIO                       /*!<@brief Signal name */
#define BOARD_SDHC_CD_CHANNEL 6                         /*!<@brief Signal channel */
#define BOARD_SDHC_CD_PIN_NAME PTE6                     /*!<@brief Routed pin name */
#define BOARD_SDHC_CD_LABEL "J15[G1]/SD_CARD_DETECT"    /*!<@brief Label */
#define BOARD_SDHC_CD_NAME "SDHC_CD"                    /*!<@brief Identifier */
#define BOARD_SDHC_CD_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_SDHC_CD_GPIO GPIOE                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_SDHC_CD_GPIO_PIN 6U                       /*!<@brief GPIO pin number */
#define BOARD_SDHC_CD_GPIO_PIN_MASK (1U << 6U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SDHC_CD_PORT PORTE                        /*!<@brief PORT peripheral base pointer */
#define BOARD_SDHC_CD_PIN 6U                            /*!<@brief PORT pin number */
#define BOARD_SDHC_CD_PIN_MASK (1U << 6U)               /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHC(void);

/*! @name USB0_DP (number 10), J22[3]/K64_MICRO_USB_DP
  @{ */
/* Routed pin properties */
#define BOARD_USB_DP_PERIPHERAL USB0                 /*!<@brief Peripheral name */
#define BOARD_USB_DP_SIGNAL DP                       /*!<@brief Signal name */
#define BOARD_USB_DP_PIN_NAME USB0_DP                /*!<@brief Routed pin name */
#define BOARD_USB_DP_LABEL "J22[3]/K64_MICRO_USB_DP" /*!<@brief Label */
#define BOARD_USB_DP_NAME "USB_DP"                   /*!<@brief Identifier */
                                                     /* @} */

/*! @name USB0_DM (number 11), J22[2]/K64_MICRO_USB_DN
  @{ */
/* Routed pin properties */
#define BOARD_USB_DM_PERIPHERAL USB0                 /*!<@brief Peripheral name */
#define BOARD_USB_DM_SIGNAL DM                       /*!<@brief Signal name */
#define BOARD_USB_DM_PIN_NAME USB0_DM                /*!<@brief Routed pin name */
#define BOARD_USB_DM_LABEL "J22[2]/K64_MICRO_USB_DN" /*!<@brief Label */
#define BOARD_USB_DM_NAME "USB_DM"                   /*!<@brief Identifier */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSB(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
